0.1.0/tutorials/incompressible/simple/wind_around_buildings/system/controlDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      controlDict;
}

application     mousse-simple;
startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         400;
deltaT          1;
writeControl    timeStep;
writeInterval   50;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;
// adjustTimeStep  yes;
// maxCo           1;
functions
{
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
