0.1.0/tutorials/incompressible/simple/wind_around_buildings/system/snappyHexMeshDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      snappyHexMeshDict;
}

#includeEtc "case_dicts/mesh/generation/snappyHexMeshDict.conf"
castellatedMesh on;
snap            on;
addLayers       off;
geometry
{
  buildings.obj
  {
    type triSurfaceMesh;
    name buildings;
  }
  refinementBox
  {
    type searchableBox;
    min  (  0   0   0);
    max  (250 180  90);
  }
};
castellatedMeshControls
{
  features
  (
   { file  "buildings.eMesh"; level 1; }
  );
  refinementSurfaces
  {
    buildings
    {
      level (3 3);
      patchInfo { type wall; }
    }
  }
  refinementRegions
  {
    refinementBox
    {
      mode inside;
      levels ((1E15 2));
    }
  }
  locationInMesh (1 1 1);
}
snapControls
{
  explicitFeatureSnap    true;
  implicitFeatureSnap    false;
}
addLayersControls
{
  layers
  {
    "CAD.*"
    {
      nSurfaceLayers 2;
    }
  }
  relativeSizes       true;
  expansionRatio      1.2;
  finalLayerThickness 0.5;
  minThickness        1e-3;
}
meshQualityControls
{
}
writeFlags
(
  scalarLevels
  layerSets
  layerFields
);
mergeTolerance 1e-6;

// vim: set ft=foam et sw=2 ts=2 sts=2:
