0.1.0/tutorials/incompressible/simple/wind_around_buildings/0/p
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      p;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  inlet
  {
    type            zeroGradient;
  }
  outlet
  {
    type            totalPressure;
    p0              uniform 0;
    gamma           1.4;
    value           uniform 0;
  }
  wall
  {
    type            zeroGradient;
  }
  #includeEtc "case_dicts/setConstraintTypes"
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
