0.1.0/tutorials/incompressible/simple/wind_around_buildings/0/k
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      k;
}

kInlet          1.5;   // approx k = 1.5*(I*U)^2 ; I = 0.1
dimensions      [0 2 -2 0 0 0 0];
internalField   uniform $kInlet;

boundaryField
{
  inlet
  {
    type            fixedValue;
    value           uniform $kInlet;
  }
  outlet
  {
    type            inletOutlet;
    inletValue      uniform $kInlet;
    value           uniform $kInlet;
  }
  wall
  {
    type            kqRWallFunction;
    value           uniform $kInlet;
  }
  #includeEtc "case_dicts/setConstraintTypes"
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
