0.1.0/tutorials/incompressible/simple/wind_around_buildings/system/meshQualityDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      meshQualityDict;
}

#includeEtc "case_dicts/mesh/generation/meshQualityDict.conf"
//- minFaceWeight (0 -> 0.5)
//minFaceWeight 0.02;

// vim: set ft=foam et sw=2 ts=2 sts=2:
